SeleniumFramework/API/APIsoap/Soaprequest/elgibilitysoapreq.xml

<?xml version="1.0" encoding="UTF-8"?><soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:v18="http://upm3.uhc.com/consumer/readconsumereligibilitydetailbypolicy/v18">
   <soapenv:Body>
      <v18:invokeService>
         <!--Optional:-->
         <arg0>
            <requestHeader>
               <applicationName>CCR</applicationName>
               <applicationInstanceName>CCR</applicationInstanceName>
               <logLevel>DEBUG</logLevel>
               <!--Optional:-->
               <externalId>AELLOT-78JY3</externalId>
               <!--Zero or more repetitions:-->
               <serviceOption>
                  <key/>
                  <value/>
               </serviceOption>
               <!--Optional:-->
               <internalUse>
                  <uid/>
                  <serviceName/>
                  <serviceVersion/>
                  <originalConsumer/>
                  <originalServiceName/>
                  <originalServiceVersion/>
                  <logSequence/>
                  <uidGeneratedBy/>
               </internalUse>
            </requestHeader>
            <!--Optional:-->
            <controlModifier>
               <!--Optional:-->
               <cdbSystemParameter>
                  <!--Optional:-->
                  <applicationId>CCR</applicationId>
                  <!--Optional:-->
                  <roleId>CCR</roleId>
               </cdbSystemParameter>
               <!--Optional:-->
               <cosmosSystemParameter>
                  <!--Optional:-->
                  <sourceId/>
                  <!--Optional:-->
                  <userId>90239</userId>
               </cosmosSystemParameter>
               <!--Optional:-->
               <ndbSystemParameter>
                  <!--Optional:-->
                  <attributeSet>detail_0002</attributeSet>
                  <!--Optional:-->
                  <projectId>CTB</projectId>
                  <!--Optional:-->
                  <racfId/>
               </ndbSystemParameter>
               <!--Optional:-->
               <niceSystemParameter>
                  <!--Optional:-->
                  <password>Ma2o460</password>
                  <!--Optional:-->
                  <username>icueclient</username>
               </niceSystemParameter>
               <!--Optional:-->
               <requestCoverageCustomDefined/>
               <!--Optional:-->
               <requestCoverageType>ALL</requestCoverageType>
               <!--Optional:-->
               <requestCustomerDefined>Y</requestCustomerDefined>
               <!--Optional:-->
               <requestExpandedDataInd>E</requestExpandedDataInd>
               <!--Optional:-->	
               <requestFinancialAccounts/>
               <!--Optional:-->
               <requestHealthServices>NONE</requestHealthServices>
               <!--Optional:-->
               <requestLanguagePreference/>
               <!--Optional:-->
               <requestMemberPopulation/>
               <!--Optional:-->
               <requestOtherInsurance/>
               <!--Optional:-->
               <requestPCP/>
               <!--Optional:-->
               <requestPlanVariationTextDescription/>
            </controlModifier>
            <!--Optional:-->
            <cdbXrefId>cdbXrefIdval</cdbXrefId>
            <!--Optional:-->
            <cdbXrefIdPartitionNumber>277</cdbXrefIdPartitionNumber>
            <!--Optional:-->
            <policyNumber>897000007451983</policyNumber>
            <!--Zero or more repetitions:-->
            <brandingTypes>NAME-20</brandingTypes>
            <!--Optional:-->
            <memberSuffix>01</memberSuffix>
            <!--Optional:-->
            <phsCompanyCode/>
            <!--Optional:-->
            <subscriberId>91238346502</subscriberId>
            <!--Optional:-->
            <asOfDate>2017-03-30</asOfDate>
            <!--Optional:-->
            <blsEligibilityInd>Y</blsEligibilityInd>
         </arg0>
      </v18:invokeService>
   </soapenv:Body>
</soapenv:Envelope>